`use strict`;

export let hallsName = [
  `سالن 1`,
  `سالن 2`,
  `سالن 3`,
  `سالن 4`,
  `سالن 5`,
  `سالن 6`,
  `سالن 7`,
  `سالن 8`,
];

export let hallLevel = [
  [`اسپان`, `24`],
  [`اسپان`, `25`],
  [`اسپان`, `26`],
  [`اسپان`, `27`],
  [`اسپان`, `28`],
  [`اسپان`, `29`],
  [`اسپان`, `30`],
  [`اسپان`, `31`],
];

export let temperature1 = {
  circleInfo: [
    [`نام`, `T1-1896754_4`],
    [`توضیحات`, `سنسور کمپوست کوتاه`],
    [`وضعیت`, `-1`],
    [`کالیبره`, `-1`],
  ],
  circleBolt: [
    [`هشدار پایین`, `-1`],
    [`هشدار بالا`, `-1`],
    [`تعداد میانگین`, `120`],
    [`تلرانس پایین`, `1`],
    [`تلرانس بالا`, `1`],
  ],
  danger: [
    [`بحرانی پایین`, `-1`],
    [`بحرانی بالا`, `-1`],
    [`تعداد میانگین`, `120`],
    [`تلرانس پایین`, `1`],
    [`تلرانس بالا`, `1`],
    [`شماره تر/خشک`, `12-1`],
  ],

  info: {
    online: 19.3,
    midd: 40,
  },
};

export let humidity = [`هشدار`, `خطر`, [19, 23, 15, 12, 19, 18, 27, 19, 24]];

export let co2 = [`هشدار`, `خطر`, 0, 1000];

export let controller = [`مه پاش`, `برق`, `چراغ`, `هاب`];

export let chart = [`نمایش`, `پردازش`];

export let lastConection = [`30/07/1403`, `12:00`];

export let countOfConection = [
  [`green`, `red`, `green`, `green`, `green`, `red`, `green`, `green`],
  `1444`,
];

export let hallManager = [
  `آفات`,
  `یادداشت`,
  `اتوماسیون`,
  `عکس`,
  `آمار برداشت`,
  `اطلاعات`,
  `تنظیمات`,
];
